espressif/arduino-esp32/libraries/Ethernet/src/ETH.cpp
    ret = esp_eth_start(_eth_handle);
    if(ret != ESP_OK){
        log_e("esp_eth_start failed: %d", ret);
        return false;
    }

    if(!perimanSetPinBus(_pin_rmii_clock, ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
    if(!perimanSetPinBus(_pin_mcd, ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
    if(!perimanSetPinBus(_pin_mdio,  ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }

    if(!perimanSetPinBus(ETH_RMII_TX_EN, ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
    if(!perimanSetPinBus(ETH_RMII_TX0, ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
    if(!perimanSetPinBus(ETH_RMII_TX1,  ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
    if(!perimanSetPinBus(ETH_RMII_RX0, ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
    if(!perimanSetPinBus(ETH_RMII_RX1_EN, ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
    if(!perimanSetPinBus(ETH_RMII_CRS_DV,  ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }

    if(_pin_power != -1){
        if(!perimanSetPinBus(_pin_power,  ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
    }
    // holds a few milliseconds to let DHCP start and enter into a good state
    // FIX ME -- adresses issue https://github.com/espressif/arduino-esp32/issues/5733
    delay(50);

    return true;

err:
    log_e("Failed to set all pins bus to ETHERNET");
    ETHClass::ethDetachBus((void *)(this));
    return false;
}
#endif /* CONFIG_ETH_USE_ESP32_EMAC */

#if ETH_SPI_SUPPORTS_CUSTOM
static void *_eth_spi_init(const void *ctx){
    return (void*)ctx;
}

static esp_err_t _eth_spi_deinit(void *ctx){
    return ESP_OK;
}

esp_err_t ETHClass::_eth_spi_read(void *ctx, uint32_t cmd, uint32_t addr, void *data, uint32_t data_len){
    return ((ETHClass*)ctx)->eth_spi_read(cmd, addr, data, data_len);
}

esp_err_t ETHClass::_eth_spi_write(void *ctx, uint32_t cmd, uint32_t addr, const void *data, uint32_t data_len){
    return ((ETHClass*)ctx)->eth_spi_write(cmd, addr, data, data_len);
}

esp_err_t ETHClass::eth_spi_read(uint32_t cmd, uint32_t addr, void *data, uint32_t data_len){
    if(_spi == NULL){
        return ESP_FAIL;
    }
    // log_i(" 0x%04lx 0x%04lx %lu", cmd, addr, data_len);
    _spi->beginTransaction(SPISettings(_spi_freq_mhz * 1000 * 1000, MSBFIRST, SPI_MODE0));
    digitalWrite(_pin_cs, LOW);

#if CONFIG_ETH_SPI_ETHERNET_DM9051
    if(_phy_type == ETH_PHY_DM9051){
        _spi->write(((cmd & 0x01) << 7) | (addr & 0x7F));
    } else
#endif
#if CONFIG_ETH_SPI_ETHERNET_W5500
    if(_phy_type == ETH_PHY_W5500){
        _spi->write16(cmd);
        _spi->write(addr);
    } else
#endif
#if CONFIG_ETH_SPI_ETHERNET_KSZ8851SNL
    if(_phy_type == ETH_PHY_KSZ8851){
        if(cmd > 1){
            _spi->write(cmd << 6 | addr);
        } else {
            _spi->write16(cmd << 14 | addr);
        }
    } else
#endif
    {
        log_e("Unsupported PHY module: %d", _phy_type);
        digitalWrite(_pin_cs, HIGH);
        _spi->endTransaction();
        return ESP_FAIL;
    }
    _spi->transferBytes(NULL, (uint8_t *)data, data_len);

    digitalWrite(_pin_cs, HIGH);
    _spi->endTransaction();
    return ESP_OK;
}

esp_err_t ETHClass::eth_spi_write(uint32_t cmd, uint32_t addr, const void *data, uint32_t data_len){
    if(_spi == NULL){
        return ESP_FAIL;
    }
    // log_i("0x%04lx 0x%04lx %lu", cmd, addr, data_len);
    _spi->beginTransaction(SPISettings(_spi_freq_mhz * 1000 * 1000, MSBFIRST, SPI_MODE0));
    digitalWrite(_pin_cs, LOW);

#if CONFIG_ETH_SPI_ETHERNET_DM9051
    if(_phy_type == ETH_PHY_DM9051){
        _spi->write(((cmd & 0x01) << 7) | (addr & 0x7F));
    } else
#endif
#if CONFIG_ETH_SPI_ETHERNET_W5500
    if(_phy_type == ETH_PHY_W5500){
        _spi->write16(cmd);
        _spi->write(addr);
    } else
#endif
#if CONFIG_ETH_SPI_ETHERNET_KSZ8851SNL
    if(_phy_type == ETH_PHY_KSZ8851){
        if(cmd > 1){
            _spi->write(cmd << 6 | addr);
        } else {
            _spi->write16(cmd << 14 | addr);
        }
    } else
#endif
    {
        log_e("Unsupported PHY module: %d", _phy_type);
        digitalWrite(_pin_cs, HIGH);
        _spi->endTransaction();
        return ESP_FAIL;
    }
    _spi->writeBytes((const uint8_t *)data, data_len);

    digitalWrite(_pin_cs, HIGH);
    _spi->endTransaction();
    return ESP_OK;
}
#endif

bool ETHClass::beginSPI(eth_phy_type_t type, uint8_t phy_addr, int cs, int irq, int rst, 
#if ETH_SPI_SUPPORTS_CUSTOM
    SPIClass *spi, 
#endif
    int sck, int miso, int mosi, spi_host_device_t spi_host, uint8_t spi_freq_mhz){
    esp_err_t ret = ESP_OK;

    if(_esp_netif != NULL || _eth_handle != NULL){
        log_w("ETH Already Started");
        return true;
    }
    if(cs < 0 || irq < 0){
        log_e("CS and IRQ pins must be defined!");
        return false;
    }

    perimanSetBusDeinit(ESP32_BUS_TYPE_ETHERNET, ETHClass::ethDetachBus);

    if(_pin_cs != -1){
        if(!perimanSetPinBus(_pin_cs, ESP32_BUS_TYPE_INIT, NULL)){ return false; }
    }
    if(_pin_rst != -1){
        if(!perimanSetPinBus(_pin_rst, ESP32_BUS_TYPE_INIT, NULL)){ return false; }
    }
    if(_pin_irq != -1){
        if(!perimanSetPinBus(_pin_irq, ESP32_BUS_TYPE_INIT, NULL)){ return false; }
    }
    if(_pin_sck != -1){
        if(!perimanSetPinBus(_pin_sck,  ESP32_BUS_TYPE_INIT, NULL)){ return false; }
    }
    if(_pin_miso != -1){
        if(!perimanSetPinBus(_pin_miso, ESP32_BUS_TYPE_INIT, NULL)){ return false; }
    }
    if(_pin_mosi != -1){
        if(!perimanSetPinBus(_pin_mosi, ESP32_BUS_TYPE_INIT, NULL)){ return false; }
    }

#if ETH_SPI_SUPPORTS_CUSTOM
    _spi = spi;
#endif
    if(spi_freq_mhz){
        _spi_freq_mhz = spi_freq_mhz;
    }
    _phy_type = type;
    _pin_cs = cs;
    _pin_irq = irq;
    _pin_rst = rst;
    _pin_sck = sck;
    _pin_miso = miso;
    _pin_mosi = mosi;

#if ETH_SPI_SUPPORTS_CUSTOM
    if(_spi != NULL){
        pinMode(_pin_cs, OUTPUT);
        digitalWrite(_pin_cs, HIGH);
    }
#endif

    // Init SPI bus
    if(_pin_sck >= 0 && _pin_miso >= 0 && _pin_mosi >= 0){
        spi_bus_config_t buscfg = {
            .mosi_io_num = _pin_mosi,
            .miso_io_num = _pin_miso,
            .sclk_io_num = _pin_sck,
            .quadwp_io_num = -1,
            .quadhd_io_num = -1,
        };
        ret = spi_bus_initialize(spi_host, &buscfg, SPI_DMA_CH_AUTO);
        if(ret != ESP_OK){
            log_e("SPI bus initialize failed: %d", ret);
            return false;
        }
    }

    Network.begin();
    _ethernets[_eth_index] = this;
    if(_eth_ev_instance == NULL && esp_event_handler_instance_register(ETH_EVENT, ESP_EVENT_ANY_ID, &_eth_event_cb, NULL, &_eth_ev_instance)){
        log_e("event_handler_instance_register for ETH_EVENT Failed!");
        return false;
    }


    // Install GPIO ISR handler to be able to service SPI Eth modules interrupts
    ret = gpio_install_isr_service(0);
    if(ret != ESP_OK && ret != ESP_ERR_INVALID_STATE){
        log_e("GPIO ISR handler install failed: %d", ret);
        return false;
    }

    // Init common MAC and PHY configs to default
    eth_mac_config_t eth_mac_config = ETH_MAC_DEFAULT_CONFIG();
    eth_phy_config_t phy_config = ETH_PHY_DEFAULT_CONFIG();

    // Update PHY config based on board specific configuration
    phy_config.phy_addr = phy_addr;
    phy_config.reset_gpio_num = _pin_rst;

    // Configure SPI interface for specific SPI module
    spi_device_interface_config_t spi_devcfg = {
        .mode = 0,
        .clock_speed_hz = _spi_freq_mhz * 1000 * 1000,
        .input_delay_ns = 20,
        .spics_io_num = _pin_cs,
        .queue_size = 20,
    };

    esp_eth_mac_t *mac = NULL;
    esp_eth_phy_t *phy = NULL;
#if CONFIG_ETH_SPI_ETHERNET_W5500
    if(type == ETH_PHY_W5500){
        eth_w5500_config_t mac_config = ETH_W5500_DEFAULT_CONFIG(spi_host, &spi_devcfg);
        mac_config.int_gpio_num = _pin_irq;
#if ETH_SPI_SUPPORTS_CUSTOM
        if(_spi != NULL){
            mac_config.custom_spi_driver.config = this;
            mac_config.custom_spi_driver.init = _eth_spi_init;
            mac_config.custom_spi_driver.deinit = _eth_spi_deinit;
            mac_config.custom_spi_driver.read = _eth_spi_read;
            mac_config.custom_spi_driver.write = _eth_spi_write;
        }
#endif
        mac = esp_eth_mac_new_w5500(&mac_config, &eth_mac_config);
        phy = esp_eth_phy_new_w5500(&phy_config);
    } else 
#endif
#if CONFIG_ETH_SPI_ETHERNET_DM9051
    if(type == ETH_PHY_DM9051){
        eth_dm9051_config_t mac_config = ETH_DM9051_DEFAULT_CONFIG(spi_host, &spi_devcfg);
        mac_config.int_gpio_num = _pin_irq;
#if ETH_SPI_SUPPORTS_CUSTOM
        if(_spi != NULL){
            mac_config.custom_spi_driver.config = this;
            mac_config.custom_spi_driver.init = _eth_spi_init;
            mac_config.custom_spi_driver.deinit = _eth_spi_deinit;
            mac_config.custom_spi_driver.read = _eth_spi_read;
            mac_config.custom_spi_driver.write = _eth_spi_write;
        }
#endif
        mac = esp_eth_mac_new_dm9051(&mac_config, &eth_mac_config);
        phy = esp_eth_phy_new_dm9051(&phy_config);
    } else
#endif
#if CONFIG_ETH_SPI_ETHERNET_KSZ8851SNL
    if(type == ETH_PHY_KSZ8851){
        eth_ksz8851snl_config_t mac_config = ETH_KSZ8851SNL_DEFAULT_CONFIG(spi_host, &spi_devcfg);
        mac_config.int_gpio_num = _pin_irq;
#if ETH_SPI_SUPPORTS_CUSTOM
        if(_spi != NULL){
            mac_config.custom_spi_driver.config = this;
            mac_config.custom_spi_driver.init = _eth_spi_init;
            mac_config.custom_spi_driver.deinit = _eth_spi_deinit;
            mac_config.custom_spi_driver.read = _eth_spi_read;
            mac_config.custom_spi_driver.write = _eth_spi_write;
        }
#endif
        mac = esp_eth_mac_new_ksz8851snl(&mac_config, &eth_mac_config);
        phy = esp_eth_phy_new_ksz8851snl(&phy_config);
    } else
#endif
    {
        log_e("Unsupported PHY module: %d", (int)type);
        return false;
    }

    // Init Ethernet driver to default and install it
    esp_eth_config_t eth_config = ETH_DEFAULT_CONFIG(mac, phy);
    ret = esp_eth_driver_install(&eth_config, &_eth_handle);
    if(ret != ESP_OK){
        log_e("SPI Ethernet driver install failed: %d", ret);
        return false;
    }
    if(_eth_handle == NULL){
        log_e("esp_eth_driver_install failed! eth_handle is NULL");
        return false;
    }

    // Derive a new MAC address for this interface
    uint8_t base_mac_addr[ETH_ADDR_LEN];
    ret = esp_efuse_mac_get_default(base_mac_addr);
    if(ret != ESP_OK){
        log_e("Get EFUSE MAC failed: %d", ret);
        return false;
    }
    uint8_t mac_addr[ETH_ADDR_LEN];
    base_mac_addr[ETH_ADDR_LEN - 1] += _eth_index; //Increment by the ETH number
    esp_derive_local_mac(mac_addr, base_mac_addr);

    ret = esp_eth_ioctl(_eth_handle, ETH_CMD_S_MAC_ADDR, mac_addr);
    if(ret != ESP_OK){
        log_e("SPI Ethernet MAC address config failed: %d", ret);
        return false;
    }

    // Use ESP_NETIF_DEFAULT_ETH when just one Ethernet interface is used and you don't need to modify
    // default esp-netif configuration parameters.
    esp_netif_config_t cfg = ESP_NETIF_DEFAULT_ETH();

    // Use ESP_NETIF_INHERENT_DEFAULT_ETH when multiple Ethernet interfaces are used and so you need to modify
    // esp-netif configuration parameters for each interface (name, priority, etc.).
    char if_key_str[10];
    char if_desc_str[10];
    char num_str[3];
    itoa(_eth_index, num_str, 10);
    strcat(strcpy(if_key_str, "ETH_"), num_str);
    strcat(strcpy(if_desc_str, "eth"), num_str);

    esp_netif_inherent_config_t esp_netif_config = ESP_NETIF_INHERENT_DEFAULT_ETH();
    esp_netif_config.if_key = if_key_str;
    esp_netif_config.if_desc = if_desc_str;
    esp_netif_config.route_prio -= _eth_index*5;

    cfg.base = &esp_netif_config;

    _esp_netif = esp_netif_new(&cfg);
    if(_esp_netif == NULL){
        log_e("esp_netif_new failed");
        return false;
    }
    // Attach Ethernet driver to TCP/IP stack
    esp_eth_netif_glue_handle_t new_netif_glue = esp_eth_new_netif_glue(_eth_handle);
    if(new_netif_glue == NULL){
        log_e("esp_eth_new_netif_glue failed");
        return false;
    }

    ret = esp_netif_attach(_esp_netif, new_netif_glue);
    if(ret != ESP_OK){
        log_e("esp_netif_attach failed: %d", ret);
        return false;
    }

    /* attach to receive events */
    initNetif((ESP_Network_Interface_ID)(ESP_NETIF_ID_ETH+_eth_index));

    // Start Ethernet driver state machine
    ret = esp_eth_start(_eth_handle);
    if(ret != ESP_OK){
        log_e("esp_eth_start failed: %d", ret);
        return false;
    }

    // If Arduino's SPI is used, cs pin is in GPIO mode
#if ETH_SPI_SUPPORTS_CUSTOM
    if(_spi == NULL){
#endif
        if(!perimanSetPinBus(_pin_cs, ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
#if ETH_SPI_SUPPORTS_CUSTOM
    }
#endif
    if(!perimanSetPinBus(_pin_irq, ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }

    if(_pin_sck != -1){
        if(!perimanSetPinBus(_pin_sck, ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
    }
    if(_pin_miso != -1){
        if(!perimanSetPinBus(_pin_miso, ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
    }
    if(_pin_mosi != -1){
        if(!perimanSetPinBus(_pin_mosi,  ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
    }
    if(_pin_rst != -1){
        if(!perimanSetPinBus(_pin_rst,  ESP32_BUS_TYPE_ETHERNET, (void *)(this))){ goto err; }
    }

